# Вывести квадрат числа

a = int (input('Введите число: '))
print(a**2)
